// 2025/04/05 21:05:27
// 2025/04/05 22:30:38 4WA
// 2025/04/05 22:34:44 AC.
#include <iostream>
#include <vector>
#include <cmath>
#include <map>
using namespace std;
int main(){
    long long N;
    cin >> N;
    long long ans = 0;
    // map<long long, int> mp;
    for (long long a = 2; a <= N; a = a << 1) {
        long long b2 = N / a;
        long long b = max(1ll, (long long)pow(b2, 0.5) - 5ll);
        while ((b + 1) * (b + 1) * a <= N) {
            b++;
        }
        ans += b / 2 + b % 2;
        // cerr << a << ' ' << b << ' ' << b / 2 + b % 2 << endl;
        // ans += b;
        // for (int i = 1; i <= b; i++) {
        //     // cerr << i * i * a << ' ';
        //     mp[i*i*a]++;
        // }
        // cerr << endl;
        // cerr << "b: " << b << endl;
        // int r = 1;
        // ans += r;
        // cerr << a << ' ' << b << ' ' << r << endl;
        // cerr << a << ' ' << b << endl;
    }
    /* debug */
    // for (auto m : mp) {
    //     cerr << '(' << m.first << ',' << m.second << ')' << ' ';
    // }
    // cerr << endl;
    cout << ans << endl;
    return 0;
}
/*
aの値は高々64通り(2025/04/05 21:06:18)
2^a かつ b^2 で有るようなやつは重複するから排除するのか・・・(2025/04/05 21:28:44)
4 2 2
16
64
4^xか。
8 2^1*2^2 2^3*1^2
16 2^2*2^2 

法則性が…
(2,1) (4,1) (8,2) (16,2) (18,1) (32,3) (36,1) (50,1) (64,3) (72,2) (98,1) (100,1) (128,4) (144,2) (162,1) (196,1) (200,2) (242,1) (256,4) (288,3) (324,1) (338,1) (392,2) (400,2) 
8: 1_2 3_1
16: 2_2, 4_1
32: 1_4, 3_2, 5_1
64: 2_4, 4_2, 6_1
72: 1_6, 3_3
128: 1_8, 3_4, 5_2, 7_1
144: 2_6, 4_3
200: 1_10, 3_5
256: 2_8, 4_4, 6_2, 8_1
わけわからん。
2: 1_1
4: 2_1
18: 1_3
36: 2_3
50: 1_5
あーいや分かる。bが2の倍数である間割っていけるのか。(2025/04/05 22:20:44)
で・・？(2025/04/05 22:21:13)
bが2の倍数の時はカウントしなければ良い！(2025/04/05 22:21:54)
*/
