#include <stdio.h>
int min(int a, int b){
    if (a < b) {
        return a;
    } else {
        return b;
    }
}
void sort3(int *a) {
    for (int i = 0; i < 3; i++) {
        for (int j = 1; i + j < 3; j++) {
            if (*(a + i) < *(a + i + j)) {
                int tmp = *(a + i);
                *(a + i) = *(a + i + j);
                *(a + i + j) = tmp;
            }
        }
    }
    return;
}
int main(void){
    int h[3], w[3], arr[3][3];
    scanf("%d %d %d %d %d %d", &h[0], &h[1], &h[2], &w[0], &w[1], &w[2]);
    sort3(h);
    sort3(w);
    int count = 0;
    //1行目初期値設定
    arr[0][0] = min(h[0], w[0]) - 2;
    arr[0][1] = h[0] - arr[0][0] - 1;
    arr[0][2] = 1/*h[0] - arr[0][0] - arr[0][1]*/;
    while (1) {
        //2行目3行目の設定と判定
        for (int j = 0; j < 3; j++) {
            arr[1][j] = w[j] - arr[0][j] - 1;
            arr[2][0] = 1;
        }
        //1行目の変更
        if (1 < arr[0][1]) {
            arr[0][1]--;
            arr[0][2]++;
        } else if (1 < arr[0][0]) {
            arr[0][0]--;
            arr[0][1] = h[0] - arr[0][0] - 1;
            arr[0][2] = 1;
        } else {
            break;
        }
    }
    pritnf("%d\n", count);
    return 0;
}

/*
4 1 1
2 1 1
1 1 1
//2022/06/18 22:05
４つだけ決めればいいのか。
っていうかこれ線形計画法じゃね。全部変数にして恒等式立てたほうが良い？

・hの和とwの和が等しくなければ0を返す
・全マスに１を埋める。(w, h > 3より可)
無駄やな。

3 1 1
2 10 1
1 2 7

1 3 1
10 2 1
2 1 7

10 2 1
1 3 1
2 1 7

10 2 1
2 1 7
1 3 1

13 10 5, 13 9 6

11 1 1
1 7 4
1 1 1
2行目から3行目に2つ移すので
11 1 1
1 5 4
1 3 1
～
11 1 1
1 7 2
1 1 3
より
11 1 1
(1) x x
(1) x x
は3通り。
10 2 1
2 6 4
1 1 1
2行目から3行目に2つ移すので
||◯◯の並び替え。ただし◯◯||は不可。


20 25 30, 22 29 24
30 25 20, 29 24 22

27 2 1
1 21 20
1 1 1

27 2 1
1 4 20
1 18 1

27 2 1
1 x x
1 x x
系が18通りかな。(17+1)C1 ◯17個と|の並び替え。
*/