/* 公式解説から作成 */
#include <iostream>
#include <vector>
using namespace std;

int main() {
	int N;
	cin >> N;
	vector<vector<int>> weight(N, vector<int>(N, 0));
    for (int i = 0; i < N; i++) {
		for(int j = i + 1; j < N; j++) {
            cin >> weight[i][j];
        }
    }

	vector<long long> dp(1 << N);
    for (int b = 0; b < dp.size(); b++) {
        for (int i = N - 1; 0 <= i; i--) {
            cerr << (b >> i & 1);
        }
        cerr << endl;
		int l = -1;
        for (int i = 0; i < N; i++) {
            if (!(b >> i & 1)) {
                l = i;
                break;
            }
        }
        for (int i = 0; i < N; i++) {
            if (!(b >> i & 1)) {
                int newb = b | (1 << l) | (1 << i);
                dp[newb] = max(dp[newb], dp[b] + weight[l][i]);
                cerr << '\t';
                for (int i = N - 1; 0 <= i; i--) {
                    cerr << (newb >> i & 1);
                }
                cerr << endl;
            }
        }
	}
    for (int d : dp) {
        cerr << d << ' ';
    }
    cerr << endl;
	cout << dp.back() << endl;
}
/*
0000:
    1100
    1010
    1001
0001:
    1101
    1011
0010:
    1110
    1011
0011:
    1111 # ここでは0011が0のままなのでwrong

0100:
    1110
    1101
0101:
    1111
0110:
    1111
0111:

1000:
    1110
    1101
1001:
    1111
1010:
    1111
1011:
1100:
    1111 # ここで初めて1100と0011の組の正しい値が評価される
1101:
1110:
1111:

0000 0001 0010 0011 0100 0101 0110 0111 1000 1001 1010 1011 1100 1101 1110 1111
   0    1    2    3    4    5    6    7    8    9   10   11   12   13   14   15

  #0    0    0    0    0    0    0    0    0    0    0    0    6    0    0    0
  #0    0    0    0    0    0    0    0    0    0    8    0    6    0    0    0
  #0    0    0    0    0    0    0    0    0    4    8    0    6    0    0    0

   0    0    0   #0    0    0    0    0    0    4    8    0    6    0    0    6

   0    0    0    0    0   #0    0    0    0    4    8    0    6    0    0    7
   0    0    0    0    0    0   #0    0    0    4    8    0    6    0    0    7(4)
   0    0    0    0    0    0    0    0    0   #4    8    0    6    0    0   11
   0    0    0    0    0    0    0    0    0    4   #8    0    6    0    0   13
   0    0    0    0    0    0    0    0    0    4    8    0   #6    0    0   13(7)
   0    0    0    0    0    0    0    0    0    4    8    0    6    0    0   13(7)

011

000
    100?
    110
    101
001?
    101?
    111
010?
    110?
    111
011
    111?
100?
    110?
    111
101
    111?
110
    111?

あー逆か。
000
    001?
    011
    101
001?
    011?
    111? # え、これが回答？
010?
    011?
    111?
011
    111?
100?
    101?
    111?
101
    111?
110
    111?

じゃあ110=6は？
0 1 2 3 4 5 6 7
0 0 0 1 0 2 0 3 

  0 1 2
0 x 1 2
1   x 3
2     x
*/
